Тест_ЗУП_31_КОРП/src/InformationRegisters/ТемыЭлементовЭлектронныхКурсов/ТемыЭлементовЭлектронныхКурсов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТемыЭлементовЭлектронныхКурсов</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаЭлементКурса</name>
    <type>
      <types>CatalogRef.ТеорияЭлектронныхКурсов</types>
      <types>CatalogRef.ТерминыЭлектронныхГлоссариев</types>
      <types>CatalogRef.УдалитьТекстыЭлектронныхКурсов</types>
      <types>CatalogRef.ЭлектронныеГлоссарии</types>
      <types>CatalogRef.ЭлектронныеРесурсы</types>
      <types>CatalogRef.ЭлектронныеКурсы</types>
      <types>CatalogRef.ЭлементыЭлектронныхРесурсов</types>
      <types>CatalogRef.ТестовыеВопросы</types>
      <types>CatalogRef.ЭлектронныеТесты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рубрикатор</name>
    <type>
      <types>CatalogRef.ЭлектронныеРубрикаторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементРубрикатора</name>
    <type>
      <types>CatalogRef.ТемыЭлектронныхРубрикаторов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиЭлектронныхКурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ТемыЭлементовЭлектронныхКурсов/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
Процедура Перезаписать(ЭлементРубрикатора, ПоставщикРубрики, СсылкаНаЭлементКурса, ВесВопроса) Экспорт
	
	Рубрикатор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементРубрикатора, "Владелец");
	
	НаборЗаписей = РегистрыСведений.ТемыЭлементовЭлектронныхКурсов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
	НаборЗаписей.Отбор.ЭлементРубрикатора.Установить(ЭлементРубрикатора);
	НаборЗаписей.Отбор.Поставщик.Установить(ПоставщикРубрики);
	НаборЗаписей.Отбор.СсылкаНаЭлементКурса.Установить(СсылкаНаЭлементКурса);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Рубрикатор = Рубрикатор;
	НоваяЗапись.ЭлементРубрикатора = ЭлементРубрикатора;
	НоваяЗапись.Поставщик = ПоставщикРубрики;
	НоваяЗапись.СсылкаНаЭлементКурса = СсылкаНаЭлементКурса;
	
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();
	НоваяЗапись.ВесВопроса = ВесВопроса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
